//Операторы сравнения

// console.log(15 > 10);

// Приведение типов к числу

// console.log(true > 0);


// Операторы равенства (== и ===) и неравенства (!= и !==)
// !!! ВСЕГДА ИСПОЛЬЗУЕМ СТРОГОЕ РАВЕНСТВО (===) и НЕРАВЕНСТВО (!==)

// const isEqual = '0' === 0
// console.log(isEqual);


/* Логическое И (оператор &&)
    Запинается на лжи
    Вощает то, на чем запнулось или последний операнд */

// console.log(1 && 0 && 5);


/* Логическое ИИЛИ (оператор ||)
    Запинается на правде
    Вощает то, на чем запнулось или последний операнд */

// console.log(false || 10 || true || 10 || 0);
    

/* Логическое НЕ (оператор !)
    Делает инверсию правда > ложь  и  ложь > правда */

    console.log(!-5);